## [penxle](https://penxle.app.spacelift.io/stack/penxle/run/01H8E96RBM2ZGMGGCT7KGKDJ7M) plan logs

<details>
<summary>Click here to expand</summary>

```
[01H8DSF4S398THN0E7S49T5E6S] Planning changes with 0 custom hooks...
module.aws.random_password.rds: Refreshing state... [id=none]
module.cloudflare.cloudflare_account.this: Refreshing state... [id=ada355841e173023d4ac3b5a9ba71669]
module.vercel.vercel_project.company: Refreshing state... [id=prj_bVMIEINABh7RicwMzBMXBQadCFtz]
module.vercel.vercel_project.landing: Refreshing state... [id=prj_nxatXit01vJmIZyZ5j7jaKutwft3]
module.vercel.vercel_project.help: Refreshing state... [id=prj_MjgvzdDGpwd1sFfSvBftqgak6zfr]
module.vercel.vercel_project.penxle: Refreshing state... [id=prj_n4LtssucyREpzFyvM3d74bAQYXwd]
module.vercel.vercel_dns_record.penxle_dev_txt_google_site_verification: Refreshing state... [id=rec_c94f4b2d7390bbb37c625e89]
module.vercel.vercel_project_domain.penxle_com: Refreshing state... [id=penxle.com]
module.cloudflare.cloudflare_zone.pnxl_co: Refreshing state... [id=7dbbc206e18ef79995ed2d20afa804e3]
module.cloudflare.cloudflare_zone.pnxl_cc: Refreshing state... [id=eba2ac0c455f1082d523fbd5865fe410]
module.cloudflare.cloudflare_zone.penxle_io: Refreshing state... [id=d10093a0fffaed4ff2f64d0599c8f91a]
module.cloudflare.cloudflare_zone.pnxl_net: Refreshing state... [id=c0b3042da9c0b436843b56eb3b89c684]
module.cloudflare.cloudflare_zone.penxle_com: Refreshing state... [id=78d0f6748950340099543c05ef149114]
module.vercel.vercel_project_domain.help_penxle_com: Refreshing state... [id=help.penxle.com]
module.vercel.vercel_project_domain.staging_penxle_com: Refreshing state... [id=staging.penxle.com]
module.vercel.vercel_project_domain.penxle_io: Refreshing state... [id=penxle.io]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_5_2: Refreshing state... [id=985b6c33e3ead8abd7427a15549cd228]
module.cloudflare.cloudflare_record.mail_penxle_io: Refreshing state... [id=2f768d1b46e0a8ebd36cded7ca5d46b3]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_5_1: Refreshing state... [id=7e662ac6bb44cd12fa98ee121e2df38c]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_10_1: Refreshing state... [id=2c760d82471b65062b7af1ab5d6e2c6e]
module.cloudflare.cloudflare_record.penxle_io: Refreshing state... [id=26c2ad26730154d219ac9641d40b7d23]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_10_2: Refreshing state... [id=45aeedf054c3cb24539829e4d4d79c52]
module.cloudflare.cloudflare_ruleset.penxle_io_dynamic_redirect: Refreshing state... [id=0ce76425120446b4b1b2b8554a3c30a9]
module.cloudflare.cloudflare_record.www_penxle_io: Refreshing state... [id=e6228dde4ddfdcc290269e6ac6dce118]
module.cloudflare.cloudflare_record.penxle_io_txt_spf1: Refreshing state... [id=f13cdacb16275d807e513a094d509c8a]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_1: Refreshing state... [id=ce5ff054439f36ac74463091acbcab83]
module.cloudflare.cloudflare_record.pnxl_cc: Refreshing state... [id=591ad9e9939bae567ef8ae4858685bd8]
module.cloudflare.cloudflare_ruleset.pnxl_cc_dynamic_redirect: Refreshing state... [id=26c99e807a11480ab64b801a8e0e3c38]
module.cloudflare.cloudflare_record.www_penxle_com: Refreshing state... [id=6c9cc1e70ff2ef1c85e20af412b07611]
module.cloudflare.cloudflare_record.penxle_com_txt_google_site_verification: Refreshing state... [id=14c242427949c9110576cd3496e93c9a]
module.cloudflare.cloudflare_record.penxle_com: Refreshing state... [id=1265337a2bc659b49cdbc289d5bbf957]
module.cloudflare.cloudflare_record.help_penxle_com: Refreshing state... [id=98a6d2b4d605bfea8e3eb24fad68e657]
module.cloudflare.cloudflare_record.staging_penxle_com: Refreshing state... [id=01ff3f930f626a2b9f3738c98a5112f3]
module.cloudflare.cloudflare_record.mail_penxle_com_txt_spf: Refreshing state... [id=0cd7b804aa1e2f52c382c90459c4dcef]
module.cloudflare.cloudflare_turnstile_widget.turnstile: Refreshing state... [id=0x4AAAAAAAIzqVNPSBt8QEAw]
module.cloudflare.cloudflare_record.mail_penxle_com_mx_10: Refreshing state... [id=48e471380ae0594031db04b21a362702]
module.cloudflare.cloudflare_ruleset.penxle_com_dynamic_redirect: Refreshing state... [id=b2d81231ff6b41fda9aab6ba2ffc7ace]
module.cloudflare.cloudflare_record.status_penxle_com: Refreshing state... [id=35d98ad65c6058e30a50dd4fee05d535]
module.cloudflare.cloudflare_record.idea_penxle_com: Refreshing state... [id=5bc63c291c54fc91dde90941d8b8c3af]
module.cloudflare.cloudflare_record.pnxl_net: Refreshing state... [id=75daf6912c044229507402014cb6649b]
module.aws.aws_iam_user.bunny_net: Refreshing state... [id=bunny.net]
module.aws.aws_s3_bucket.penxle_artifacts: Refreshing state... [id=penxle-artifacts]
module.aws.aws_ecs_cluster.penxle: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:721144421085:cluster/penxle]
module.aws.aws_s3_bucket.penxle_uploads: Refreshing state... [id=penxle-uploads]
module.aws.aws_iam_role.lambda_literoom_transform: Refreshing state... [id=literoom-transform@lambda]
module.aws.data.aws_s3_object.literoom_transform: Reading...
module.aws.data.aws_caller_identity.current: Reading...
module.aws.aws_iam_user.penxle_com: Refreshing state... [id=penxle.com]
module.aws.aws_eip.nat_private_az1: Refreshing state... [id=eipalloc-061c04af4f98f7e65]
module.aws.aws_sesv2_configuration_set.penxle: Refreshing state... [id=penxle-1]
module.aws.aws_apigatewayv2_api.penxle: Refreshing state... [id=g3o08sodoa]
module.aws.aws_elasticache_user.iam_user: Refreshing state... [id=iam-user]
module.aws.aws_iam_role.ecs_actions_runner: Refreshing state... [id=actions-runner@ecs]
module.aws.aws_s3_bucket.penxle_data: Refreshing state... [id=penxle-data]
module.aws.aws_iam_role.lambda_penxle: Refreshing state... [id=penxle@lambda]
module.aws.data.aws_caller_identity.current: Read complete after 1s [id=721144421085]
module.aws.aws_eip.nat_private_az2: Refreshing state... [id=eipalloc-07cdd4e76b303ca2c]
module.aws.data.aws_s3_object.actions_runner_orchestrator: Reading...
module.aws.data.aws_s3_object.literoom_transform: Read complete after 1s [id=penxle-artifacts/literoom/transform.hash]
module.aws.aws_vpc.penxle: Refreshing state... [id=vpc-0579c94f99e93ed11]
module.aws.data.aws_s3_object.penxle: Reading...
module.aws.aws_iam_role.lambda_literoom_finalize: Refreshing state... [id=literoom-finalize@lambda]
module.aws.data.aws_s3_object.literoom_layer: Reading...
module.aws.aws_iam_role.ecs_task_execution: Refreshing state... [id=task-execution@ecs]
module.aws.aws_iam_role.lambda_actions_runner_orchestrator: Refreshing state... [id=actions-runner-orchestrator@lambda]
module.aws.aws_elasticache_user.default: Refreshing state... [id=default-user]
module.aws.data.aws_s3_object.actions_runner_orchestrator: Read complete after 1s [id=penxle-artifacts/actions-runner-orchestrator/function.hash]
module.aws.data.aws_s3_object.literoom_finalize: Reading...
module.cloudflare.cloudflare_zone_dnssec.each["penxle.com"]: Refreshing state... [id=78d0f6748950340099543c05ef149114]
module.aws.data.aws_s3_object.penxle: Read complete after 1s [id=penxle-artifacts/penxle/function.hash]
module.cloudflare.cloudflare_zone_dnssec.each["pnxl.cc"]: Refreshing state... [id=eba2ac0c455f1082d523fbd5865fe410]
module.cloudflare.cloudflare_zone_settings_override.each["pnxl.cc"]: Refreshing state... [id=eba2ac0c455f1082d523fbd5865fe410]
module.aws.data.aws_s3_object.literoom_layer: Read complete after 1s [id=penxle-artifacts/literoom/layer.hash]
module.cloudflare.cloudflare_zone_dnssec.each["penxle.io"]: Refreshing state... [id=d10093a0fffaed4ff2f64d0599c8f91a]
module.cloudflare.cloudflare_zone_settings_override.each["pnxl.co"]: Refreshing state... [id=7dbbc206e18ef79995ed2d20afa804e3]
module.aws.data.aws_s3_object.literoom_finalize: Read complete after 1s [id=penxle-artifacts/literoom/finalize.hash]
module.cloudflare.cloudflare_zone_settings_override.each["pnxl.net"]: Refreshing state... [id=c0b3042da9c0b436843b56eb3b89c684]
module.cloudflare.cloudflare_zone_settings_override.each["penxle.com"]: Refreshing state... [id=78d0f6748950340099543c05ef149114]
module.cloudflare.cloudflare_zone_settings_override.each["penxle.io"]: Refreshing state... [id=d10093a0fffaed4ff2f64d0599c8f91a]
module.cloudflare.cloudflare_zone_dnssec.each["pnxl.co"]: Refreshing state... [id=7dbbc206e18ef79995ed2d20afa804e3]
module.cloudflare.cloudflare_zone_dnssec.each["pnxl.net"]: Refreshing state... [id=c0b3042da9c0b436843b56eb3b89c684]
module.aws.aws_iam_access_key.bunny_net: Refreshing state... [id=AKIA2PZ4OTLO6SI5Z5NU]
module.aws.aws_iam_access_key.penxle_com: Refreshing state... [id=AKIA2PZ4OTLOUWF432XM]
module.aws.aws_apigatewayv2_stage.penxle: Refreshing state... [id=$default]
module.aws.aws_sesv2_email_identity.penxle_com: Refreshing state... [id=penxle.com]
module.aws.aws_iam_role_policy.lambda_penxle: Refreshing state... [id=penxle@lambda:penxle@lambda]
module.aws.aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=task-execution@ecs-20230821200932963000000001]
module.aws.aws_iam_role_policy.ecs_task_execution: Refreshing state... [id=task-execution@ecs:task-execution@ecs]
module.aws.aws_ecs_task_definition.actions_runner: Refreshing state... [id=actions-runner]
module.aws.aws_elasticache_user_group.iam: Refreshing state... [id=iam]
module.aws.aws_lambda_function.penxle: Refreshing state... [id=penxle]
module.aws.aws_iam_role_policy.ecs_actions_runner: Refreshing state... [id=actions-runner@ecs:actions-runner@ecs]
module.aws.aws_lambda_function.actions_runner_orchestrator: Refreshing state... [id=actions-runner-orchestrator]
module.aws.aws_lambda_layer_version.literoom_layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:721144421085:layer:literoom:2]
module.aws.aws_s3_bucket_cors_configuration.penxle_uploads: Refreshing state... [id=penxle-uploads]
module.aws.aws_iam_user_policy.penxle_com: Refreshing state... [id=penxle.com:penxle_com]
module.aws.aws_internet_gateway.public: Refreshing state... [id=igw-02841768b0d5df0b5]
module.aws.aws_subnet.private_az2: Refreshing state... [id=subnet-09d82bf9e1fb6bdb6]
module.aws.aws_default_route_table.default: Refreshing state... [id=rtb-0950b6daf3b08fb39]
module.aws.aws_security_group.public: Refreshing state... [id=sg-0c563bbb691ee581d]
module.aws.aws_subnet.private_az1: Refreshing state... [id=subnet-024dd73d6018d2e39]
module.aws.aws_subnet.public_az2: Refreshing state... [id=subnet-064f753d822401555]
module.aws.aws_security_group.private: Refreshing state... [id=sg-07b4d23e540b34d41]
module.aws.aws_subnet.public_az1: Refreshing state... [id=subnet-0c0f1c2302a02567e]
module.aws.aws_default_security_group.default: Refreshing state... [id=sg-067a56de8c85dad16]
module.aws.aws_sesv2_email_identity_mail_from_attributes.penxle_com: Refreshing state... [id=penxle.com]
module.aws.aws_iam_role_policy.lambda_actions_runner_orchestrator: Refreshing state... [id=actions-runner-orchestrator@lambda:actions-runner-orchestrator@lambda]
module.aws.aws_s3_access_point.penxle_data: Refreshing state... [id=721144421085:penxle-data]
module.aws.aws_iam_role_policy.lambda_literoom_finalize: Refreshing state... [id=literoom-finalize@lambda:literoom-finalize@lambda]
module.aws.aws_lambda_function.literoom_transform: Refreshing state... [id=literoom-transform]
module.aws.aws_route_table.public: Refreshing state... [id=rtb-0037c56d3641675e1]
module.aws.aws_lambda_function.literoom_finalize: Refreshing state... [id=literoom-finalize]
module.aws.aws_lambda_permission.penxle: Refreshing state... [id=penxle]
module.aws.aws_apigatewayv2_integration.penxle: Refreshing state... [id=onlld36]
module.aws.aws_lambda_function_url.actions_runner_orchestrator: Refreshing state... [id=actions-runner-orchestrator]
module.aws.aws_nat_gateway.private_az2: Refreshing state... [id=nat-07e8421386570bb87]
module.aws.aws_nat_gateway.private_az1: Refreshing state... [id=nat-006cfa6af4c86382c]
module.aws.aws_elasticache_subnet_group.public: Refreshing state... [id=public]
module.aws.aws_db_subnet_group.public: Refreshing state... [id=public]
module.aws.aws_route_table_association.public_az1: Refreshing state... [id=rtbassoc-08f5a0d346f0fe7d1]
module.aws.aws_route_table_association.public_az2: Refreshing state... [id=rtbassoc-0081fb74a60935325]
module.aws.aws_apigatewayv2_route.penxle: Refreshing state... [id=4m37xyn]
module.cloudflare.cloudflare_record._domainkey_penxle_com["ep5ll2uqfx5n4ayiess25l3pn4j7ayum"]: Refreshing state... [id=fa8580bdfc9fb464d3fa5ffc8547ad23]
module.cloudflare.cloudflare_record._domainkey_penxle_com["ntl3we67sato5l5rrsmw6gnm5ivmqydy"]: Refreshing state... [id=5fd8ad5e3b3b73c1da7f8b792bb8ee29]
module.cloudflare.cloudflare_record._domainkey_penxle_com["akxggupt5k5bodiac7u5yb5tnigdyzff"]: Refreshing state... [id=de0b3275c887c055838aee806ae5bcf7]
module.aws.aws_lambda_permission.literoom_finalize: Refreshing state... [id=literoom-finalize]
module.aws.aws_route_table.private_az2: Refreshing state... [id=rtb-01b105ec2c8d116f5]
module.aws.aws_route_table.private_az1: Refreshing state... [id=rtb-0da3d8c6e5be8a332]
module.aws.aws_s3control_object_lambda_access_point.penxle_images: Refreshing state... [id=721144421085:penxle-images]
module.aws.aws_elasticache_replication_group.penxle: Refreshing state... [id=penxle]
module.aws.aws_s3_bucket_notification.penxle_uploads: Refreshing state... [id=penxle-uploads]
module.aws.aws_rds_cluster.penxle: Refreshing state... [id=penxle]
module.aws.aws_route_table_association.private_az2: Refreshing state... [id=rtbassoc-0307ce566eb66f906]
module.aws.aws_route_table_association.private_az1: Refreshing state... [id=rtbassoc-0e1fd91757af53e10]
module.aws.aws_iam_user_policy.bunny_net: Refreshing state... [id=bunny.net:bunny.net]
module.aws.aws_iam_role_policy.lambda_literoom_transform: Refreshing state... [id=literoom-transform@lambda:literoom-transform@lambda]
module.aws.aws_rds_cluster_instance.penxle[0]: Refreshing state... [id=penxle-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vercel.vercel_project.company must be replaced
-/+ resource "vercel_project" "company" {
      + git_repository                          = {
          + production_branch = (known after apply)
          + repo              = "penxle/penxle" # forces replacement
          + type              = "github" # forces replacement
        }
      ~ id                                      = "prj_bVMIEINABh7RicwMzBMXBQadCFtz" -> (known after apply)
        name                                    = "company"
      + protection_bypass_for_automation_secret = (known after apply)
      + serverless_function_region              = (known after apply)
      ~ team_id                                 = "team_caSDGfJT7fCtr12rcud7VR1R" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project.help must be replaced
-/+ resource "vercel_project" "help" {
      + git_repository                          = {
          + production_branch = (known after apply)
          + repo              = "penxle/penxle" # forces replacement
          + type              = "github" # forces replacement
        }
      ~ id                                      = "prj_MjgvzdDGpwd1sFfSvBftqgak6zfr" -> (known after apply)
        name                                    = "help"
      + protection_bypass_for_automation_secret = (known after apply)
      + serverless_function_region              = (known after apply)
      ~ team_id                                 = "team_caSDGfJT7fCtr12rcud7VR1R" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project.landing must be replaced
-/+ resource "vercel_project" "landing" {
      + git_repository                          = {
          + production_branch = (known after apply)
          + repo              = "penxle/penxle" # forces replacement
          + type              = "github" # forces replacement
        }
      ~ id                                      = "prj_nxatXit01vJmIZyZ5j7jaKutwft3" -> (known after apply)
        name                                    = "landing"
      + protection_bypass_for_automation_secret = (known after apply)
      ~ serverless_function_region              = "iad1" -> (known after apply)
      ~ team_id                                 = "team_caSDGfJT7fCtr12rcud7VR1R" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project.penxle must be replaced
-/+ resource "vercel_project" "penxle" {
      + git_repository                          = {
          + production_branch = (known after apply)
          + repo              = "penxle/penxle" # forces replacement
          + type              = "github" # forces replacement
        }
      ~ id                                      = "prj_n4LtssucyREpzFyvM3d74bAQYXwd" -> (known after apply)
        name                                    = "penxle"
      + protection_bypass_for_automation_secret = (known after apply)
      ~ serverless_function_region              = "iad1" -> (known after apply)
      ~ team_id                                 = "team_caSDGfJT7fCtr12rcud7VR1R" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project_domain.help_penxle_com must be replaced
-/+ resource "vercel_project_domain" "help_penxle_com" {
      ~ id         = "help.penxle.com" -> (known after apply)
      ~ project_id = "prj_MjgvzdDGpwd1sFfSvBftqgak6zfr" # forces replacement -> (known after apply) # forces replacement
      ~ team_id    = "team_caSDGfJT7fCtr12rcud7VR1R" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vercel.vercel_project_domain.penxle_com must be replaced
-/+ resource "vercel_project_domain" "penxle_com" {
      ~ id         = "penxle.com" -> (known after apply)
      ~ project_id = "prj_nxatXit01vJmIZyZ5j7jaKutwft3" # forces replacement -> (known after apply) # forces replacement
      ~ team_id    = "team_caSDGfJT7fCtr12rcud7VR1R" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vercel.vercel_project_domain.penxle_io must be replaced
-/+ resource "vercel_project_domain" "penxle_io" {
      ~ id         = "penxle.io" -> (known after apply)
      ~ project_id = "prj_bVMIEINABh7RicwMzBMXBQadCFtz" # forces replacement -> (known after apply) # forces replacement
      ~ team_id    = "team_caSDGfJT7fCtr12rcud7VR1R" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vercel.vercel_project_domain.staging_penxle_com must be replaced
-/+ resource "vercel_project_domain" "staging_penxle_com" {
      ~ id         = "staging.penxle.com" -> (known after apply)
      ~ project_id = "prj_n4LtssucyREpzFyvM3d74bAQYXwd" # forces replacement -> (known after apply) # forces replacement
      ~ team_id    = "team_caSDGfJT7fCtr12rcud7VR1R" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.

[01H8DSF4S398THN0E7S49T5E6S] Changes are GO
[01H8DSF4S398THN0E7S49T5E6S] Uploading the list of managed resources...
[01H8DSF4S398THN0E7S49T5E6S] Generating Infracost JSON report from plan
time="2023-08-22T09:30:53Z" level=warning msg="No products found for module.aws.aws_rds_cluster_instance.penxle[0] Database instance (on-demand, db.serverless), using 0.00"
time="2023-08-22T09:30:53Z" level=warning msg="No products found for module.aws.aws_rds_cluster_instance.penxle[0] Database instance (on-demand, db.serverless), using 0.00"

[01H8DSF4S398THN0E7S49T5E6S] Infracost report generated successfully
[01H8DSF4S398THN0E7S49T5E6S] Mapping Infracost data to Terraform resources
[01H8DSF4S398THN0E7S49T5E6S] Costs mapped successfully
[01H8DSF4S398THN0E7S49T5E6S] Please be aware that Run changes calculation includes Terraform output changes.
[01H8DSF4S398THN0E7S49T5E6S] Resource list upload is GO
[01H8DSF4S398THN0E7S49T5E6S] Generating JSON representation of the plan...
[01H8DSF4S398THN0E7S49T5E6S] JSON representation is GO
[01H8DSF4S398THN0E7S49T5E6S] Generating Infracost JSON report from plan
time="2023-08-22T09:31:09Z" level=warning msg="No products found for module.aws.aws_rds_cluster_instance.penxle[0] Database instance (on-demand, db.serverless), using 0.00"
time="2023-08-22T09:31:09Z" level=warning msg="No products found for module.aws.aws_rds_cluster_instance.penxle[0] Database instance (on-demand, db.serverless), using 0.00"

[01H8DSF4S398THN0E7S49T5E6S] Infracost report generated successfully
[01H8DSF4S398THN0E7S49T5E6S] Loading custom plan policy inputs...
[01H8DSF4S398THN0E7S49T5E6S] 0 custom plan policy inputs found
[01H8DSF4S398THN0E7S49T5E6S] No plan policies to evaluate
```

</details>